{
  "recipes": [
    {
      "id": "1",
      "title": "Sticky miso peppers",
      "ingredients": "1 x 220g tin of pineapple rings in juice, 80g extra firm tofu, 2 mixed-colour peppers, olive oil, 4 spring onions, 4 cloves of garlic, 90g rice vermicelli noodles, 20g wasabi peas, 2 heaped teaspoons red miso paste",
      "instructions": "Place the pineapple rings (reserving the juice) in a large dry non-stick frying pan on a medium heat. Cut the tofu into four chunks and add to the pan. Let it all gently char for 4 minutes, then turn, char on the other side and remove, leaving the pan on the heat. Deseed the peppers, chop into 2cm chunks and place in the pan with ½ a tablespoon of olive oil, then reduce to a medium-low heat. Trim the spring onions, chop the white halves into 2cm lengths and add to the pan, reserving the green tops. Peel, finely slice and add the garlic, then cook it all for 10 minutes, or until soft and charred, stirring regularly. Meanwhile, finely slice the green halves of the spring onions. In a heatproof bowl, cover the noodles with boiling kettle water. In a pestle and mortar, pound the wasabi peas until fine. Mix the miso paste into the reserved pineapple juice, then pour into the pepper pan with a splash of water. Let it sizzle for a minute, then return the tofu and pineapple to the pan to glaze. Drain the noodles, divide between your plates and spoon over the sticky miso peppers, followed by the tofu and pineapple. Sprinkle with the sliced green spring onion and crushed wasabi peas, then tuck right in.",
      "img": "https://asset.jamieoliver.com/images/cq7w2e71/production/3ade07c49cf82a6581f9ad59adf342d64c20a8e2-958x1280.jpg/109469682?rect=0,2,958,1277&w=1920&h=2560&fm=webp&q=80&fit=crop&auto=format"
    },
    {
      "id": "2",
      "title": "Cheat's fish & chips",
      "ingredients": "800g potatoes, olive oil, 1 rasher of higher-welfare smoked streaky bacon, 100g stale bread, 50g plain flour, 1 large free-range egg, 4 x 125g white fish fillets, skin on, scaled, pin-boned, from sustainable sources, 500g frozen peas, 1 bunch of mint (30g)",
      "instructions": "Preheat the oven to 220°C/425°F/gas 7. Scrub the potatoes, chop lengthways into 2cm wedges, toss with 1 tablespoon of olive oil and a pinch of sea salt and black pepper, then arrange in a single layer on your largest roasting tray. Roast for 40 minutes, or until golden and cooked through, shaking halfway. Meanwhile, roughly chop the bacon and place in a food processor, tear in the bread, add 1 tablespoon of oil and blitz into fine crumbs, then spread across a plate. Spread the flour across a second plate, and beat the egg on another. One by one, turn the fish in the flour, then the egg, letting any excess drip off, and finally turn in the bacon crumb. Line up on a non-stick baking tray and roast for 15 minutes, or until golden. Cook the peas in a pan of boiling salted water, then drain and mash well. Pick the mint leaves into a pestle and mortar, pound into a paste, then muddle in 1 tablespoon each of red wine vinegar and extra virgin olive oil, and season to perfection. Serve the fish and chips with the peas, dolloped with the mint sauce.",
      "img": "https://asset.jamieoliver.com/images/cq7w2e71/production/d4ebbb683ba5d310479f16488dd1eabdc765b5d7-958x1280.jpg/109469661?rect=0,2,958,1277&w=1920&h=2560&fm=webp&q=80&fit=crop&auto=format"
    },
    {
      "id": "3",
      "title": "Halloumi eggy crumpets",
      "ingredients": "2 large free-range eggs, 2 crumpets, 80g ripe mixed-colour cherry tomatoes, 1 teaspoon hot chilli sauce, ½ a lime, 2 sprigs of coriander, ¼ of a small ripe avocado, olive oil, 8g halloumi cheese",
      "instructions": "Beat one egg in a shallow bowl, then add the crumpets to soak on both sides. To make the salsa, quarter the tomatoes, then mix in a small bowl with the chilli sauce and a squeeze of lime juice. Season to perfection, then pick over the coriander leaves. Peel, chop and add the avocado, ready to toss just before serving. Put a non-stick frying pan on a medium heat with 1 teaspoon of olive oil. Crack in the remaining egg, then add the crumpets alongside, and cover. Flip the crumpets when golden, and cook the egg to your liking. Move it all to your plate, then quickly coarsely grate the halloumi into the pan. Toss the salsa and spoon over the crumpets. Once the halloumi is golden, use a fish slice to nudge it loose and flip it proudly over your plate, golden side up. Finish with extra chilli sauce, if you like.",
      "img": "https://asset.jamieoliver.com/images/cq7w2e71/production/ab910598b3ecaee9bb53eb6262150a94958a1f70-958x1280.jpg/109927561?rect=0,2,958,1277&w=1920&h=2560&fm=webp&q=80&fit=crop&auto=format"
    },
    {
      "id": "4",
      "title": "Special scrambled eggs",
      "ingredients": "4 large free-range eggs, 2 soft buns, 1 red onion, red wine vinegar, olive oil, 1 teaspoon garam masala, 200g ripe tomatoes, ½ a bunch of coriander (15g)",
      "instructions": "Whisk and season the eggs. Halve the buns. Peel and coarsely grate the onion, then put 1 tablespoon into a bowl with a pinch of sea salt and a splash of red wine vinegar, and leave to quickly pickle. Scatter the rest into a large non-stick frying pan on a medium heat with 1 tablespoon of olive oil and most of the garam masala. Fry for 3 minutes, stirring often, while you coarsely grate the tomatoes. Push the onions aside and pour in the tomatoes to sizzle for 2 minutes. As soon as they start to dry out, mix and fry for 2 more minutes, or until thick, stirring occasionally. Push the tomato chutney to one side, then toast the buns on both sides, wiping them around the pan to pick up any gnarly sticky bits. Spread the tomato chutney on the bun bases, tear off and pile on the coriander leaves, squash the lids on top, then remove to your plates. Scramble the eggs to your liking and spoon alongside, then top with the drained pickled onion and serve dusted with garam masala.",
      "img": "https://asset.jamieoliver.com/images/cq7w2e71/production/e3ff568388c439422542af8190d171c60a20e195-958x1280.jpg/109927564?rect=0,2,958,1277&w=1920&h=2560&fm=webp&q=80&fit=crop&auto=format"
    },
    {
      "id": "5",
      "title": "My favourite speedy sausage pizza",
      "ingredients": "150g self-raising flour, plus extra for dusting, olive oil, 2 higher-welfare Cumberland or veggie sausages, 1 small red onion, 1 sprig of rosemary, 1 heaped tablespoon sun-dried tomato paste, 100g red seedless grapes, 1 x 125g ball of mozzarella cheese, 1 tablespoon pine nuts",
      "instructions": "Preheat the oven to full whack (240ºC). Pile the flour into a bowl with a small pinch of sea salt, add 80ml of water and mix into a dough, then knead on a flour-dusted surface for 2 minutes, adding a little extra flour, if needed. Roll and stretch out into a large oval (about 15cm x 30cm), then place in a large sturdy oiled tray. Cover with a clean damp tea towel and leave to rest while you put a small non-stick frying pan on a medium-high heat, then squeeze balls of sausagemeat out of the skins into the pan (if using veggie sausages, roughly slice and use 1 tablespoon of olive oil for frying). Fry until golden all over, tossing regularly, while you peel the red onion and slice super finely, ideally on a mandolin (use the guard!). Pick the rosemary leaves and toss with the onion, a pinch of sea salt and black pepper and 1 tablespoon of oil until well coated. Spread the tomato paste over the dough, sprinkle over the dressed red onion, and spoon over the sausage balls. Toss the grapes into the pan for 1 minute, then spoon over the pizza with any juices, tear over the mozzarella and sprinkle with the pine nuts. Place the tray over a high heat on the hob until it starts to sizzle, then cook at the bottom of the oven for 10 minutes, or until golden and crisp.",
      "img": "https://asset.jamieoliver.com/images/cq7w2e71/production/b9a821d15787835c049f3d8e1679920f164d4c1f-958x1280.jpg/111660418?rect=0,2,958,1277&w=1920&h=2560&fm=webp&q=80&fit=crop&auto=format"
    },
    {
      "id": "6",
      "title": "Mushroom cannelloni",
      "ingredients": "2 small onions, 2 cloves of garlic, olive oil, 2 leeks, 750g chestnut mushrooms, 75g plain flour, 1 litre semi-skimmed milk, 120g Cheddar cheese, 250g dried cannelloni tubes",
      "instructions": "Preheat the oven to 180°C/350°F/gas 4. Peel the onions and garlic, then pulse until very fine in a food processor. Tip into a large casserole pan on a medium-high heat with 1 tablespoon of olive oil. Trim, wash, pulse and add the leeks. Saving 2 mushrooms for later, pulse the rest and stir into the pan. Cook it all for 15 minutes, stirring regularly, then season to perfection and turn the heat off. Meanwhile, for the sauce, pour 3 tablespoons of oil into a separate pan on a medium heat. Whisk in the flour for 2 minutes, then gradually whisk in the milk. Simmer for 5 minutes, or until thickened, then grate in the cheese and season to perfection. Pour one third of the sauce into a 25cm x 30cm roasting tray. As soon as the filling is cool enough to work with, push both ends of each pasta tube into it to fill, lining them up in the tray as you go. Pour over the rest of the sauce, then finely slice the reserved mushrooms and use them to decorate the top. Drizzle with 1 tablespoon of oil and bake for 45 minutes, or until golden and cooked through.",
      "img": "https://asset.jamieoliver.com/images/cq7w2e71/production/4d5093be89c5fc03f7b171a4c5e6e054a32d1693-958x1280.jpg/109386578?rect=0,2,958,1277&w=1920&h=2560&fm=webp&q=80&fit=crop&auto=format"
    },
    {
      "id": "7",
      "title": "My kinda butter chicken",
      "ingredients": "2–3 fresh mixed-colour chillies, 350g ripe mixed-colour cherry tomatoes, 4 cloves of garlic, 6cm piece of ginger, 1 tablespoon garam masala, 4 heaped tablespoons natural yoghurt, 2 x 150g free-range skinless chicken breasts, olive oil, 2 tablespoons smooth cashew butter",
      "instructions": "Halve and deseed the chillies. Place in a large non-stick frying pan on a high heat with the tomatoes and blacken all over, turning occasionally. Meanwhile, peel the garlic and ginger, and finely grate into a large bowl. Add most of the garam masala, a pinch of sea salt and black pepper and 1 tablespoon of yoghurt. Deeply score the chicken breasts at 1cm intervals, then massage with the marinade. Once charred, remove the tomatoes and chillies to a board, returning the pan to a medium heat with ½ a tablespoon of olive oil and the chicken. Cook and char for 10 minutes, turning halfway, while you pinch off and discard the tomato skins and roughly chop 1–2 of the chillies, to taste. Remove the gnarly chicken from the pan and go in with the tomatoes, chopped chillies and cashew butter. Pour in 250ml of boiling kettle water and stir to pick up the sticky bits. Let it bubble vigorously for 2 minutes and once it starts to thicken, return the chicken to the pan, turning in the sauce for a final 2 minutes, or until cooked through, then remove to a board. Off the heat, season the sauce to perfection, then ripple through the remaining yoghurt. Slice the chicken and serve with the remaining chilli and garam masala.",
      "img": "https://asset.jamieoliver.com/images/cq7w2e71/production/7fb5df9aa1ab8ba3872570d7a02c1df2b1bd8389-958x1280.jpg/109469658?rect=0,2,958,1277&w=1920&h=2560&fm=webp&q=80&fit=crop&auto=format"
    },
    {
      "id": "8",
      "title": "Cauliflower cheese pasta",
      "ingredients": "100g stale sourdough bread, 2 cloves of garlic, ½ a head of cauliflower (400g), olive oil, 1 onion, 400ml semi-skimmed milk, 300g dried spaghetti, 70g Cheddar cheese",
      "instructions": "Tear the bread into a food processor. Peel and add the garlic, then tear in any nice leaves from your cauliflower. Add ½ a tablespoon of olive oil, blitz into fairly fine crumbs, then tip into a large non-stick frying pan on a medium heat. Cook for 15 minutes, or until golden and crisp, stirring occasionally. Meanwhile, peel the onion, then roughly chop with the cauliflower, stalk and all. Tip the crispy crumbs into a bowl, returning the pan to the heat. Pour in the milk and add the chopped veg, bring just to the boil, then reduce the heat to low, cover and simmer. Alongside, cook the pasta in a pan of boiling salted water according to the packet instructions. Just before the pasta is ready, carefully pour the cauliflower mixture into the processor (there’s no need to wash it), grate in the cheese, blitz until super smooth, then season to perfection, and return to the pan. Drain the pasta, reserving a mugful of starchy cooking water. Toss the pasta through the sauce, loosening with a splash of reserved cooking water, if needed, then serve with the crispy crumbs, for sprinkling.",
      "img": "https://asset.jamieoliver.com/images/cq7w2e71/production/10d438a636edcc084681b32119dff79a30d43c1b-958x1280.jpg/109386574?rect=0,2,958,1277&w=1920&h=2560&fm=webp&q=80&fit=crop&auto=format"
    },
    {
      "id": "9",
      "title": "Veggie quesadillas",
      "ingredients": "3 leeks, 3 peppers, 1 large carrot, 140g Cheddar or Red Leicester cheese, optional: a few sprigs of fresh soft herbs, such as parsley, mint, coriander, 8 large flour tortillas, 200g tub of houmous, extra virgin olive oil, 1 lemon or lime, optional: 1 fresh chilli, 120g natural yoghurt, optional: chipotle chilli sauce",
      "instructions": "Peel off the outer layers of the leeks, leaving the tender inner part (save the outsides for stew or soup, or even stock or gravy), then finely chop. Deseed and finely chop the peppers. Wash and coarsely grate the carrot. Put all the veg in a bowl, coarsely grate in the cheese, adding more if you have it, then mix it all together. If you’ve got fresh herbs, add some roughly chopped leaves. To assemble, scatter the veg and cheese mixture across four tortillas, then top with the remaining tortillas. Put a large non-stick frying pan on a medium heat. One at a time, dry fry the quesadillas for 5 minutes, or until golden and crisp on the outside, and the cheese has melted in the middle, turning halfway. Meanwhile, jazz up your houmous. Add half a tablespoon of extra virgin olive oil and a squeeze of lemon or lime juice to the houmous tub, and mix together. You can add some fresh herbs here if you have any. Let each quesadilla cool for at least a minute before slicing into wedges. Finely slice the chilli, if using. Serve with the jazzed-up houmous and yoghurt for dunking, topped with chilli sauce and the sliced fresh chilli to add a bit of heat, if you like. Great with a fresh, crunchy salad on the side.",
      "img": "https://asset.jamieoliver.com/images/cq7w2e71/production/0bcac1d5393a3a49748f14b7a8d28618c9c77e94-958x1280.jpg/105648222?rect=0,2,958,1277&w=1920&h=2560&fm=webp&q=80&fit=crop&auto=format"
    },
    {
      "id": "10",
      "title": "Hero tomato sauce",
      "ingredients": "4 cloves of garlic, olive oil, 2 fresh red chillies, 1 big bunch of fresh basil (60g), 4 x 400g tins of quality cherry tomatoes",
      "instructions": "Peel and finely slice the garlic and place in a large pan on a medium heat with 2 tablespoons of oil. Fry until lightly golden, stirring occasionally, while you halve the chillies lengthways (deseed if you like) and stir into the pan. Tear in the basil (stalks and all). Scrunch in the tomatoes through your clean hands, then swirl a little water around each tin and pour into the pan. Bring the whole lot to the boil, then simmer for 10 to 15 minutes. Remove the pan from the heat, and now you’ve got a choice – you can either leave the sauce chunky, or I like to pass it through a coarse sieve, making sure to really push all that goodness through. Taste, season to perfection with sea salt and black pepper, and you’re done. You can use the sauce straight away, cover and keep it in the fridge for up to 1 week, or divide between ziplock bags, label and freeze in portions for future meals.",
      "img": "https://asset.jamieoliver.com/images/cq7w2e71/production/12ec1c6a3761bc0d4d7bb57f165de3c4ab1b9c8d-958x1280.jpg/79945535?rect=0,2,958,1277&w=1920&h=2560&fm=webp&q=80&fit=crop&auto=format"
    },
    {
      "id": "ab1e",
      "title": "sadasd",
      "ingredients": "asdasd",
      "instructions": "asdasddsadsa"
    },
    {
      "id": "6b04",
      "title": "ertgr",
      "ingredients": "erthger",
      "instructions": "etge"
    },
    {
      "id": "aa7a",
      "title": "111",
      "ingredients": "222",
      "instructions": "333"
    },
    {
      "id": "ea96",
      "title": "222",
      "ingredients": "222",
      "instructions": "222"
    },
    {
      "id": "3bb8",
      "title": "33",
      "ingredients": "33",
      "instructions": "333"
    },
    {
      "id": "3608",
      "title": "444",
      "ingredients": "444",
      "instructions": "444444"
    },
    {
      "id": "71b7",
      "title": "5555",
      "ingredients": "5555",
      "instructions": "5555"
    }
  ]
}