{
  "recipes": [
    {
      "id": 1,
      "title": "Sticky miso peppers",
      "ingredients": "1 x 220g tin of pineapple rings in juice, 80g extra firm tofu, 2 mixed-colour peppers, olive oil, 4 spring onions, 4 cloves of garlic, 90g rice vermicelli noodles, 20g wasabi peas, 2 heaped teaspoons red miso paste",
      "instructions": "Place the pineapple rings (reserving the juice) in a large dry non-stick frying pan on a medium heat. Cut the tofu into four chunks and add to the pan. Let it all gently char for 4 minutes, then turn, char on the other side and remove, leaving the pan on the heat. Deseed the peppers, chop into 2cm chunks and place in the pan with ½ a tablespoon of olive oil, then reduce to a medium-low heat. Trim the spring onions, chop the white halves into 2cm lengths and add to the pan, reserving the green tops. Peel, finely slice and add the garlic, then cook it all for 10 minutes, or until soft and charred, stirring regularly. Meanwhile, finely slice the green halves of the spring onions. In a heatproof bowl, cover the noodles with boiling kettle water. In a pestle and mortar, pound the wasabi peas until fine. Mix the miso paste into the reserved pineapple juice, then pour into the pepper pan with a splash of water. Let it sizzle for a minute, then return the tofu and pineapple to the pan to glaze. Drain the noodles, divide between your plates and spoon over the sticky miso peppers, followed by the tofu and pineapple. Sprinkle with the sliced green spring onion and crushed wasabi peas, then tuck right in.",
      "picture": "https://asset.jamieoliver.com/images/cq7w2e71/production/3ade07c49cf82a6581f9ad59adf342d64c20a8e2-958x1280.jpg/109469682?rect=0,2,958,1277&w=1920&h=2560&fm=webp&q=80&fit=crop&auto=format"
    },
    {
      "id": 2,
      "title": "Cheat's fish & chips",
      "ingredients": "800g potatoes, olive oil, 1 rasher of higher-welfare smoked streaky bacon, 100g stale bread, 50g plain flour, 1 large free-range egg, 4 x 125g white fish fillets, skin on, scaled, pin-boned, from sustainable sources, 500g frozen peas, 1 bunch of mint (30g)",
      "instructions": "Preheat the oven to 220°C/425°F/gas 7. Scrub the potatoes, chop lengthways into 2cm wedges, toss with 1 tablespoon of olive oil and a pinch of sea salt and black pepper, then arrange in a single layer on your largest roasting tray. Roast for 40 minutes, or until golden and cooked through, shaking halfway. Meanwhile, roughly chop the bacon and place in a food processor, tear in the bread, add 1 tablespoon of oil and blitz into fine crumbs, then spread across a plate. Spread the flour across a second plate, and beat the egg on another. One by one, turn the fish in the flour, then the egg, letting any excess drip off, and finally turn in the bacon crumb. Line up on a non-stick baking tray and roast for 15 minutes, or until golden. Cook the peas in a pan of boiling salted water, then drain and mash well. Pick the mint leaves into a pestle and mortar, pound into a paste, then muddle in 1 tablespoon each of red wine vinegar and extra virgin olive oil, and season to perfection. Serve the fish and chips with the peas, dolloped with the mint sauce.",
      "picture": "https://asset.jamieoliver.com/images/cq7w2e71/production/d4ebbb683ba5d310479f16488dd1eabdc765b5d7-958x1280.jpg/109469661?rect=0,2,958,1277&w=1920&h=2560&fm=webp&q=80&fit=crop&auto=format"
    },
    {
      "id": 3,
      "title": "Halloumi eggy crumpets",
      "ingredients": "2 large free-range eggs, 2 crumpets, 80g ripe mixed-colour cherry tomatoes, 1 teaspoon hot chilli sauce, ½ a lime, 2 sprigs of coriander, ¼ of a small ripe avocado, olive oil, 8g halloumi cheese",
      "instructions": "Beat one egg in a shallow bowl, then add the crumpets to soak on both sides. To make the salsa, quarter the tomatoes, then mix in a small bowl with the chilli sauce and a squeeze of lime juice. Season to perfection, then pick over the coriander leaves. Peel, chop and add the avocado, ready to toss just before serving. Put a non-stick frying pan on a medium heat with 1 teaspoon of olive oil. Crack in the remaining egg, then add the crumpets alongside, and cover. Flip the crumpets when golden, and cook the egg to your liking. Move it all to your plate, then quickly coarsely grate the halloumi into the pan. Toss the salsa and spoon over the crumpets. Once the halloumi is golden, use a fish slice to nudge it loose and flip it proudly over your plate, golden side up. Finish with extra chilli sauce, if you like.",
      "picture": "https://asset.jamieoliver.com/images/cq7w2e71/production/ab910598b3ecaee9bb53eb6262150a94958a1f70-958x1280.jpg/109927561?rect=0,2,958,1277&w=1920&h=2560&fm=webp&q=80&fit=crop&auto=format"
    }
    
  ]
}
